### PySpark Dataframe
- Reading The Dataset
- Checking the Datatypes of the Column(Schema)
- Selecting Columns And Indexing
- Check Describe option similar to Pandas
- Adding Columns
- Dropping columns
- Renaming Columns

In [2]:
pip install pyspark

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pyspark in c:\users\surya.mahesh\appdata\roaming\python\python311\site-packages (3.5.2)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\surya.mahesh\appdata\roaming\python\python311\site-packages (from pyspark) (0.10.9.7)
Note: you may need to restart the kernel to use updated packages.

In [3]:
from pyspark.sql import SparkSession

In [4]:
SparkSession

pyspark.sql.session.SparkSession

In [5]:
spark = SparkSession.builder.appName('SparkByExamples').getOrCreate()

In [6]:
spark

In [7]:
spark.sparkContext

In [8]:
## READ THE DATASET

In [9]:
data=spark.read.csv('Educational_Universities_data.csv',header=True)

In [10]:
data.printSchema()

root
 |-- Country: string (nullable = true)
 |-- State: string (nullable = true)
 |-- University Name: string (nullable = true)
 |-- Type of University: string (nullable = true)
 |-- Tie Up with University: string (nullable = true)
 |-- School: string (nullable = true)
 |-- Technologies/Courses Offered: string (nullable = true)
 |-- Course Types: string (nullable = true)
 |-- Unplaced %: string (nullable = true)
 |-- Corporate Tie Up: string (nullable = true)
 |-- Job Offering: string (nullable = true)
 |-- Internship: string (nullable = true)
 |-- Marketing Strategy: string (nullable = true)
 |-- Costing: string (nullable = true)
 |-- Hackathons: string (nullable = true)
 |-- Services Offered: string (nullable = true)
 |-- Scholarships: string (nullable = true)
 |-- Tier: string (nullable = true)
 |-- Ranking: string (nullable = true)

In [11]:
data

DataFrame[Country: string, State: string, University Name: string, Type of University: string, Tie Up with University: string, School: string, Technologies/Courses Offered: string, Course Types: string, Unplaced %: string, Corporate Tie Up: string, Job Offering: string, Internship: string, Marketing Strategy: string, Costing: string, Hackathons: string, Services Offered: string, Scholarships: string, Tier: string, Ranking: string]

In [12]:
data.show()

+---------+--------------------+--------------------+------------------+----------------------+-----------+----------------------------+------------+----------+----------------+------------+----------+------------------+-------+----------+----------------+------------+------+-------+
|  Country|               State|     University Name|Type of University|Tie Up with University|     School|Technologies/Courses Offered|Course Types|Unplaced %|Corporate Tie Up|Job Offering|Internship|Marketing Strategy|Costing|Hackathons|Services Offered|Scholarships|  Tier|Ranking|
+---------+--------------------+--------------------+------------------+----------------------+-----------+----------------------------+------------+----------+----------------+------------+----------+------------------+-------+----------+----------------+------------+------+-------+
|Australia|Australian Capita...|Australian Nation...|            Public|                    No|    Science|              Cyber Security|   Full-time|      6.59|              No|         Yes|        No|       Traditional| $41874|       Yes|      Consulting|          No|Tier 3|     24|
|Australia|Australian Capita...|University of Can...|            Public|                   Yes|    Science|                          ML|      Online|      6.87|              No|          No|        No|       Traditional| $18404|       Yes|        Training|          No|Tier 1|    336|
|Australia|     New South Wales|University of Sydney|           Private|                   Yes|Engineering|                          AI|   Full-time|     10.78|             Yes|          No|        No|              Both| $39218|       Yes|            Both|          No|Tier 1|     19|
|Australia|     New South Wales|University of New...|           Private|                   Yes|       Arts|                         IoT|   Part-time|      5.23|              No|          No|        No|              Both| $19648|       Yes|      Consulting|          No|Tier 1|    429|
|Australia|     New South Wales|University of New...|           Private|                   Yes|Engineering|              Cyber Security|   Part-time|     16.04|              No|         Yes|        No|       Traditional| $21278|       Yes|            Both|         Yes|Tier 2|    132|
|Australia|     New South Wales|University of Wol...|           Private|                    No|       Arts|                          AI|   Full-time|      7.88|             Yes|         Yes|        No|       Traditional| $15774|       Yes|            Both|         Yes|Tier 1|     56|
|Australia|     New South Wales|Macquarie University|           Private|                    No|   Business|              Cyber Security|   Part-time|     19.41|              No|         Yes|       Yes|           Digital| $34490|       Yes|            Both|         Yes|Tier 1|    648|
|Australia|     New South Wales|University of Tec...|           Private|                    No|    Science|                Data Science|   Part-time|      5.95|             Yes|          No|       Yes|       Traditional| $32846|       Yes|            Both|         Yes|Tier 1|    940|
|Australia|     New South Wales|Charles Sturt Uni...|            Public|                    No|    Science|                Data Science|   Full-time|     15.63|              No|         Yes|       Yes|              Both| $22312|        No|            Both|          No|Tier 1|      9|
|Australia|     New South Wales|Southern Cross Un...|           Private|                    No|       Arts|                         IoT|   Part-time|      7.97|             Yes|          No|        No|       Traditional| $28211|       Yes|            Both|          No|Tier 1|    650|
|Australia|     New South Wales|University of Div...|            Public|                    No|   Business|                          ML|   Full-time|     19.61|              No|          No|       Yes|           Digital| $36941|       Yes|            Both|          No|Tier 1|    868|
|Australia|            Victoria|University of Mel...|            Public|                   Yes|       Arts|              Cyber Security|      Online|      9.17|             Yes|          No|        No|       Traditional| $14584|       Yes|            Both|         Yes|Tier 1|    722|
|Australia|            Victoria|   Monash University|           Private|                   Yes|    Science|              Cyber Security|      Online|     15.64|              No|         Yes|        No|              Both| $33250|        No|      Consulting|         Yes|Tier 1|    505|
|Australia|            Victoria|     RMIT University|            Public|                    No|       Arts|                          AI|   Full-time|      12.7|              No|          No|        No|              Both| $37466|       Yes|            Both|          No|Tier 2|    240|
|Australia|            Victoria|   Deakin University|           Private|                   Yes|   Business|                          ML|   Part-time|     16.72|             Yes|         Yes|        No|              Both| $45827|       Yes|        Training|         Yes|Tier 2|    957|
|Australia|            Victoria| La Trobe University|            Public|                   Yes|   Business|                          AI|   Full-time|     15.72|             Yes|         Yes|       Yes|              Both| $49984|        No|      Consulting|          No|Tier 2|    250|
|Australia|            Victoria| Victoria University|           Private|                    No|    Science|                Data Science|      Online|     10.62|             Yes|          No|        No|           Digital| $34270|       Yes|      Consulting|          No|Tier 2|     43|
|Australia|          Queensland|University of Que...|           Private|                    No|   Business|              Cyber Security|      Online|      7.73|             Yes|          No|       Yes|           Digital| $13507|        No|            Both|          No|Tier 1|    202|
|Australia|          Queensland|Queensland Univer...|            Public|                    No|    Science|                         IoT|      Online|      9.03|              No|          No|        No|       Traditional| $15391|        No|        Training|         Yes|Tier 1|    879|
|Australia|          Queensland| Griffith University|            Public|                   Yes|Engineering|                         IoT|      Online|      8.22|             Yes|          No|       Yes|           Digital| $41341|       Yes|        Training|          No|Tier 2|    480|
+---------+--------------------+--------------------+------------------+----------------------+-----------+----------------------------+------------+----------+----------------+------------+----------+------------------+-------+----------+----------------+------------+------+-------+
only showing top 20 rows

In [13]:
type(data)

pyspark.sql.dataframe.DataFrame

In [14]:
data.toPandas()

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [15]:
data.head()

Row(Country='Australia', State='Australian Capital Territory', University Name='Australian National University (ANU)', Type of University='Public', Tie Up with University='No', School='Science', Technologies/Courses Offered='Cyber Security', Course Types='Full-time', Unplaced %='6.59', Corporate Tie Up='No', Job Offering='Yes', Internship='No', Marketing Strategy='Traditional', Costing='$41874', Hackathons='Yes', Services Offered='Consulting', Scholarships='No', Tier='Tier 3', Ranking='24')

In [16]:
type(data)

pyspark.sql.dataframe.DataFrame

In [17]:
data.createOrReplaceTempView("data_view")

In [18]:
query= "SELECT * from data_view LIMIT 1"

In [19]:
query

'SELECT * from data_view LIMIT 1'

In [20]:
result=spark.sql(query)

In [21]:
result.show()

+---------+--------------------+--------------------+------------------+----------------------+-------+----------------------------+------------+----------+----------------+------------+----------+------------------+-------+----------+----------------+------------+------+-------+
|  Country|               State|     University Name|Type of University|Tie Up with University| School|Technologies/Courses Offered|Course Types|Unplaced %|Corporate Tie Up|Job Offering|Internship|Marketing Strategy|Costing|Hackathons|Services Offered|Scholarships|  Tier|Ranking|
+---------+--------------------+--------------------+------------------+----------------------+-------+----------------------------+------------+----------+----------------+------------+----------+------------------+-------+----------+----------------+------------+------+-------+
|Australia|Australian Capita...|Australian Nation...|            Public|                    No|Science|              Cyber Security|   Full-time|      6.59|              No|         Yes|        No|       Traditional| $41874|       Yes|      Consulting|          No|Tier 3|     24|
+---------+--------------------+--------------------+------------------+----------------------+-------+----------------------------+------------+----------+----------------+------------+----------+------------------+-------+----------+----------------+------------+------+-------+

In [22]:
df=data.toPandas()

In [23]:
df

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [24]:
result_df=result.toPandas()

In [25]:
result_df

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24

In [26]:
result.toPandas()

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24

In [27]:
data.toPandas()

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [28]:
query = "SELECT Country,State,School,Ranking FROM data_view order by Ranking ASC"

In [29]:
query

'SELECT Country,State,School,Ranking FROM data_view order by Ranking ASC'

In [30]:
result=spark.sql(query)

In [31]:
result.show()

+------------+---------------+-----------+-------+
|     Country|          State|     School|Ranking|
+------------+---------------+-----------+-------+
|        Oman|          Sohar|    Science|    106|
|Saudi Arabia|         Dammam|    Science|    108|
|     Lebanon|         Beirut|    Science|    114|
|     Lebanon|         Beirut|    Science|    117|
|        Iraq|          Wasit|       Arts|    119|
|      Kuwait|    Kuwait City|   Business|    120|
|     Lebanon|         Beirut|   Business|    129|
|   Australia|New South Wales|Engineering|    132|
|       Qatar|           Doha|    Science|    132|
|       Egypt|          Cairo|    Science|    133|
|Saudi Arabia|         Riyadh|    Science|    136|
|   Palestine|        Tulkarm|    Science|    136|
|     Lebanon|         Beirut|Engineering|    144|
|       Syria|      Al-Safira|Engineering|    147|
|       Syria|    Al-Zabadani|Engineering|    155|
|     Bahrain|         Manama|   Business|    161|
|      Jordan|          Amman|    Science|    163|
|     Lebanon|         Beirut|Engineering|    164|
|      Jordan|          Amman|       Arts|    168|
|Saudi Arabia|          Tabuk|       Arts|    173|
+------------+---------------+-----------+-------+
only showing top 20 rows

In [32]:
result.toPandas()

          Country     State       School Ranking
0            Oman     Sohar      Science     106
1    Saudi Arabia    Dammam      Science     108
2         Lebanon    Beirut      Science     114
3         Lebanon    Beirut      Science     117
4            Iraq     Wasit         Arts     119
..            ...       ...          ...     ...
242  Saudi Arabia    Dammam  Engineering     980
243       Lebanon    Beirut         Arts     982
244        Jordan     Aqaba         Arts     987
245     Palestine  Ramallah         Arts     996
246         Syria   Palmyra         Arts     997

[247 rows x 4 columns]

In [33]:
df=result.toPandas()

In [34]:
df

          Country     State       School Ranking
0            Oman     Sohar      Science     106
1    Saudi Arabia    Dammam      Science     108
2         Lebanon    Beirut      Science     114
3         Lebanon    Beirut      Science     117
4            Iraq     Wasit         Arts     119
..            ...       ...          ...     ...
242  Saudi Arabia    Dammam  Engineering     980
243       Lebanon    Beirut         Arts     982
244        Jordan     Aqaba         Arts     987
245     Palestine  Ramallah         Arts     996
246         Syria   Palmyra         Arts     997

[247 rows x 4 columns]

In [35]:
df.head()

        Country   State   School Ranking
0          Oman   Sohar  Science     106
1  Saudi Arabia  Dammam  Science     108
2       Lebanon  Beirut  Science     114
3       Lebanon  Beirut  Science     117
4          Iraq   Wasit     Arts     119

In [36]:
df.tail()

          Country     State       School Ranking
242  Saudi Arabia    Dammam  Engineering     980
243       Lebanon    Beirut         Arts     982
244        Jordan     Aqaba         Arts     987
245     Palestine  Ramallah         Arts     996
246         Syria   Palmyra         Arts     997

In [37]:
df=data.toPandas()

In [38]:
df.head()

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132

In [39]:
df.tail()

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [40]:
data.head(1)

[Row(Country='Australia', State='Australian Capital Territory', University Name='Australian National University (ANU)', Type of University='Public', Tie Up with University='No', School='Science', Technologies/Courses Offered='Cyber Security', Course Types='Full-time', Unplaced %='6.59', Corporate Tie Up='No', Job Offering='Yes', Internship='No', Marketing Strategy='Traditional', Costing='$41874', Hackathons='Yes', Services Offered='Consulting', Scholarships='No', Tier='Tier 3', Ranking='24')]

In [41]:
data.toPandas().head(1)

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24

In [42]:
data.tail(1)

[Row(Country='Jordan', State='Karak', University Name='Mutah University', Type of University='Public', Tie Up with University='Yes', School='Arts', Technologies/Courses Offered='IoT', Course Types='Part-time', Unplaced %='16.13', Corporate Tie Up='Yes', Job Offering='No', Internship='Yes', Marketing Strategy='Digital', Costing='$39328', Hackathons='Yes', Services Offered='Consulting', Scholarships='No', Tier='Tier 3', Ranking='360')]

In [43]:
data.toPandas().tail(1)

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [44]:
data_df=data.toPandas()

In [45]:
data_df

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [46]:
data.select(['Country','State']).show()

+---------+--------------------+
|  Country|               State|
+---------+--------------------+
|Australia|Australian Capita...|
|Australia|Australian Capita...|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|          Queensland|
|Australia|          Queensland|
|Australia|          Queensland|
+---------+--------------------+
only showing top 20 rows

In [47]:
spark.sql('select Country,State from data_view').show()

+---------+--------------------+
|  Country|               State|
+---------+--------------------+
|Australia|Australian Capita...|
|Australia|Australian Capita...|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|     New South Wales|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|            Victoria|
|Australia|          Queensland|
|Australia|          Queensland|
|Australia|          Queensland|
+---------+--------------------+
only showing top 20 rows

In [48]:
data.select(['Country']).show()

+---------+
|  Country|
+---------+
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
+---------+
only showing top 20 rows

In [49]:
spark.sql('select Country from data_view').show()

+---------+
|  Country|
+---------+
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
|Australia|
+---------+
only showing top 20 rows

In [50]:
spark.sql('select Country from data_view').toPandas()

       Country
0    Australia
1    Australia
2    Australia
3    Australia
4    Australia
..         ...
242     Jordan
243     Jordan
244     Jordan
245     Jordan
246     Jordan

[247 rows x 1 columns]

In [51]:
data.select(['Country']).head()

Row(Country='Australia')

In [52]:
data.select(['Country']).head(5)

[Row(Country='Australia'),
 Row(Country='Australia'),
 Row(Country='Australia'),
 Row(Country='Australia'),
 Row(Country='Australia')]

In [53]:
spark.sql('select Country from data_view').toPandas().head()

     Country
0  Australia
1  Australia
2  Australia
3  Australia
4  Australia

In [54]:
data['Country']

Column<'Country'>

In [55]:
data.dtypes

[('Country', 'string'),
 ('State', 'string'),
 ('University Name', 'string'),
 ('Type of University', 'string'),
 ('Tie Up with University', 'string'),
 ('School', 'string'),
 ('Technologies/Courses Offered', 'string'),
 ('Course Types', 'string'),
 ('Unplaced %', 'string'),
 ('Corporate Tie Up', 'string'),
 ('Job Offering', 'string'),
 ('Internship', 'string'),
 ('Marketing Strategy', 'string'),
 ('Costing', 'string'),
 ('Hackathons', 'string'),
 ('Services Offered', 'string'),
 ('Scholarships', 'string'),
 ('Tier', 'string'),
 ('Ranking', 'string')]

In [56]:
data_df.dtypes

Country                         object
State                           object
University Name                 object
Type of University              object
Tie Up with University          object
School                          object
Technologies/Courses Offered    object
Course Types                    object
Unplaced %                      object
Corporate Tie Up                object
Job Offering                    object
Internship                      object
Marketing Strategy              object
Costing                         object
Hackathons                      object
Services Offered                object
Scholarships                    object
Tier                            object
Ranking                         object
dtype: object

In [57]:
data.describe()

DataFrame[summary: string, Country: string, State: string, University Name: string, Type of University: string, Tie Up with University: string, School: string, Technologies/Courses Offered: string, Course Types: string, Unplaced %: string, Corporate Tie Up: string, Job Offering: string, Internship: string, Marketing Strategy: string, Costing: string, Hackathons: string, Services Offered: string, Scholarships: string, Tier: string, Ranking: string]

In [58]:
data.describe().toPandas()

,summary,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,count,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247
1,mean,None,None,None,None,None,None,None,None,12.89987854251013,None,None,None,None,None,None,None,None,None,511.73279352226723
2,stddev,None,None,None,None,None,None,None,None,4.297411820988518,None,None,None,None,None,None,None,None,None,285.2054341918664
3,min,Australia,Abha,Abu Dhabi University,Private,No,Arts,AI,Full-time,10.07,No,No,No,Both,$10037,No,Both,No,Tier 1,106
4,max,UAE,Zouk Mosbeh,Zayed University,Public,Yes,Science,ML,Part-time,9.99,Yes,Yes,Yes,Traditional,$49984,Yes,Training,Yes,Tier 3,997

In [59]:
data_df.describe()

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
count,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247,247
unique,13,114,243,2,2,4,5,3,224,2,2,2,3,247,2,3,2,3,218
top,Lebanon,Beirut,Universit� des Sciences et Technologies de Tri...,Private,No,Arts,AI,Full-time,12.7,Yes,No,Yes,Traditional,$41874,Yes,Consulting,No,Tier 3,922
freq,42,36,2,127,130,72,56,103,4,131,124,134,95,1,127,90,144,97,3

In [60]:
# Add columns to existing data frame

In [61]:
data['Ranking']

Column<'Ranking'>

In [62]:
data.select(['Ranking']).head()

Row(Ranking='24')

In [63]:
data=data.withColumn('Ranking After 2 Years',data['Ranking']-2)

In [64]:
data_df.columns

Index(['Country', 'State', 'University Name', 'Type of University',
       'Tie Up with University', 'School', 'Technologies/Courses Offered',
       'Course Types', 'Unplaced %', 'Corporate Tie Up', 'Job Offering',
       'Internship', 'Marketing Strategy', 'Costing', 'Hackathons',
       'Services Offered', 'Scholarships', 'Tier', 'Ranking'],
      dtype='object')

In [65]:
data_df

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [66]:
data_df=data.toPandas()

In [67]:
data_df.columns

Index(['Country', 'State', 'University Name', 'Type of University',
       'Tie Up with University', 'School', 'Technologies/Courses Offered',
       'Course Types', 'Unplaced %', 'Corporate Tie Up', 'Job Offering',
       'Internship', 'Marketing Strategy', 'Costing', 'Hackathons',
       'Services Offered', 'Scholarships', 'Tier', 'Ranking',
       'Ranking After 2 Years'],
      dtype='object')

In [68]:
data_df

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking,Ranking After 2 Years
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24,22.0
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336,334.0
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19,17.0
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429,427.0
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132,130.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270,268.0
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869,867.0
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463,461.0
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650,648.0
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360,358.0

In [69]:
### Drop the columns

In [70]:
data=data.drop('Ranking After 2 Years')

In [71]:
data

DataFrame[Country: string, State: string, University Name: string, Type of University: string, Tie Up with University: string, School: string, Technologies/Courses Offered: string, Course Types: string, Unplaced %: string, Corporate Tie Up: string, Job Offering: string, Internship: string, Marketing Strategy: string, Costing: string, Hackathons: string, Services Offered: string, Scholarships: string, Tier: string, Ranking: string]

In [72]:
data_df=data.toPandas()

In [73]:
data_df

,Country,State,University Name,Type of University,Tie Up with University,School,Technologies/Courses Offered,Course Types,Unplaced %,Corporate Tie Up,Job Offering,Internship,Marketing Strategy,Costing,Hackathons,Services Offered,Scholarships,Tier,Ranking
0,Australia,Australian Capital Territory,Australian National University (ANU),Public,No,Science,Cyber Security,Full-time,6.59,No,Yes,No,Traditional,$41874,Yes,Consulting,No,Tier 3,24
1,Australia,Australian Capital Territory,University of Canberra,Public,Yes,Science,ML,Online,6.87,No,No,No,Traditional,$18404,Yes,Training,No,Tier 1,336
2,Australia,New South Wales,University of Sydney,Private,Yes,Engineering,AI,Full-time,10.78,Yes,No,No,Both,$39218,Yes,Both,No,Tier 1,19
3,Australia,New South Wales,University of New South Wales (UNSW Sydney),Private,Yes,Arts,IoT,Part-time,5.23,No,No,No,Both,$19648,Yes,Consulting,No,Tier 1,429
4,Australia,New South Wales,University of Newcastle,Private,Yes,Engineering,Cyber Security,Part-time,16.04,No,Yes,No,Traditional,$21278,Yes,Both,Yes,Tier 2,132
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,Jordan,Zarqa,Al-Zarqa Private University,Public,No,Arts,Cyber Security,Part-time,14.49,No,Yes,Yes,Digital,$21300,Yes,Both,No,Tier 3,270
243,Jordan,Madaba,American University of Madaba,Private,No,Arts,AI,Online,17.82,Yes,Yes,No,Traditional,$28886,No,Training,No,Tier 3,869
244,Jordan,Ajloun,Ajloun National University,Private,Yes,Engineering,IoT,Part-time,10.07,No,No,No,Traditional,$28004,Yes,Training,Yes,Tier 1,463
245,Jordan,Mafraq,Al al-Bayt University,Private,No,Arts,AI,Full-time,7.76,Yes,Yes,Yes,Digital,$22407,No,Consulting,No,Tier 1,650
246,Jordan,Karak,Mutah University,Public,Yes,Arts,IoT,Part-time,16.13,Yes,No,Yes,Digital,$39328,Yes,Consulting,No,Tier 3,360

In [74]:
data_df.columns

Index(['Country', 'State', 'University Name', 'Type of University',
       'Tie Up with University', 'School', 'Technologies/Courses Offered',
       'Course Types', 'Unplaced %', 'Corporate Tie Up', 'Job Offering',
       'Internship', 'Marketing Strategy', 'Costing', 'Hackathons',
       'Services Offered', 'Scholarships', 'Tier', 'Ranking'],
      dtype='object')

In [75]:
data=data.withColumnRenamed('Ranking','NIRF Ranking')

In [76]:
data_df=data.toPandas()

In [77]:
data_df.columns

Index(['Country', 'State', 'University Name', 'Type of University',
       'Tie Up with University', 'School', 'Technologies/Courses Offered',
       'Course Types', 'Unplaced %', 'Corporate Tie Up', 'Job Offering',
       'Internship', 'Marketing Strategy', 'Costing', 'Hackathons',
       'Services Offered', 'Scholarships', 'Tier', 'NIRF Ranking'],
      dtype='object')

In [78]:
data_df['NIRF Ranking']

0       24
1      336
2       19
3      429
4      132
      ...
242    270
243    869
244    463
245    650
246    360
Name: NIRF Ranking, Length: 247, dtype: object

In [79]:
data=data.withColumnRenamed('NIRF Ranking','Ranking')

In [80]:
data_df=data.toPandas()

In [81]:
data_df.columns

Index(['Country', 'State', 'University Name', 'Type of University',
       'Tie Up with University', 'School', 'Technologies/Courses Offered',
       'Course Types', 'Unplaced %', 'Corporate Tie Up', 'Job Offering',
       'Internship', 'Marketing Strategy', 'Costing', 'Hackathons',
       'Services Offered', 'Scholarships', 'Tier', 'Ranking'],
      dtype='object')


### Pyspark Handling Missing Values
- Dropping Columns
- Dropping Rows
- Various Parameter In Dropping functionalities
- Handling Missing values by Mean, MEdian And Mode

In [82]:
data=spark.read.csv('test2.csv',header=True,inferSchema=True)

In [83]:
data.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [84]:
data.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [85]:
df=data.toPandas()

In [86]:
df

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7       None  34.0        10.0  38000.0
8       None  36.0         NaN      NaN

In [87]:
df.columns

Index(['Name', 'age', 'Experience', 'Salary'], dtype='object')

In [88]:
# drop columns

In [89]:
data.drop('Name').show()

+----+----------+------+
| age|Experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 20000|
|  21|         1| 15000|
|  23|         2| 18000|
|NULL|      NULL| 40000|
|  34|        10| 38000|
|  36|      NULL|  NULL|
+----+----------+------+

In [90]:
data.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [91]:
data.drop('age').show()

+---------+----------+------+
|     Name|Experience|Salary|
+---------+----------+------+
|    Krish|        10| 30000|
|Sudhanshu|         8| 25000|
|    Sunny|         4| 20000|
|     Paul|         3| 20000|
|   Harsha|         1| 15000|
|  Shubham|         2| 18000|
|   Mahesh|      NULL| 40000|
|     NULL|        10| 38000|
|     NULL|      NULL|  NULL|
+---------+----------+------+

In [92]:
data.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [93]:
data.na.drop().show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [94]:
data.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [95]:
### any==how
data.na.drop(how="any").show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [96]:
### threshold
data.na.drop(how="any",thresh=1).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [97]:
### threshold
data.na.drop(how="any",thresh=2).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [98]:
### threshold
data.na.drop(how="any",thresh=3).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [99]:
### threshold
data.na.drop(how="any",thresh=4).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [100]:
### threshold
data.na.drop(how="any",thresh=5).show()

+----+---+----------+------+
|Name|age|Experience|Salary|
+----+---+----------+------+
+----+---+----------+------+

In [101]:
data.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [102]:




##subset
data.na.drop(how="any",subset=["Age"]).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
|     NULL| 36|      NULL|  NULL|
+---------+---+----------+------+

In [103]:
data.na.drop(subset=["Age"]).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
|     NULL| 36|      NULL|  NULL|
+---------+---+----------+------+

In [104]:

data.na.drop(subset=["Name"]).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
+---------+----+----------+------+

In [105]:
data.na.drop(subset=["Experience"]).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [106]:
data.na.drop(subset=["Name","Age"]).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [107]:
## fill the missing values

In [108]:
data.na.fill('Missing Value').show()

+-------------+----+----------+------+
|         Name| age|Experience|Salary|
+-------------+----+----------+------+
|        Krish|  31|        10| 30000|
|    Sudhanshu|  30|         8| 25000|
|        Sunny|  29|         4| 20000|
|         Paul|  24|         3| 20000|
|       Harsha|  21|         1| 15000|
|      Shubham|  23|         2| 18000|
|       Mahesh|NULL|      NULL| 40000|
|Missing Value|  34|        10| 38000|
|Missing Value|  36|      NULL|  NULL|
+-------------+----+----------+------+

In [109]:
data.na.fill('Missing Values',['Name']).show()

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Sudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|          Paul|  24|         3| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|NULL|      NULL| 40000|
|Missing Values|  34|        10| 38000|
|Missing Values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [110]:
data.na.fill(0,['Age','Experience','Salary']).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh|  0|         0| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|         0|     0|
+---------+---+----------+------+

In [111]:
data.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [112]:
data.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [113]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age', 'Experience', 'Salary'], 
    outputCols=["{}_imputed".format(c) for c in ['age', 'Experience', 'Salary']]
    ).setStrategy("median")

In [114]:
# Add imputation cols to df
imputer.fit(data).transform(data).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   Harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   Mahesh|NULL|      NULL| 40000|         29|                 4|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 4|         20000|
+---------+----+----------+------+-----------+------------------+--------------+

## Pyspark Dataframes
- Filter Operation
- &,|,==
- ~

In [115]:
data=spark.read.csv('test1.csv',header=True,inferSchema=True)

In [116]:
data.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

## Filter Operations

In [117]:
### Salary of the people less than or equal to 20000

In [118]:
data.filter("Salary<=20000").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [119]:
### Salary of the people equal to 20000

In [120]:
data.filter("Salary==20000").show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|Sunny| 29|         4| 20000|
| Paul| 24|         3| 20000|
+-----+---+----------+------+

In [121]:
data.filter("Salary<=20000").select(["Name"]).show()

+-------+
|   Name|
+-------+
|  Sunny|
|   Paul|
| Harsha|
|Shubham|
+-------+

In [122]:
data.filter("Salary<=20000").select(["Name","Age"]).show()

+-------+---+
|   Name|Age|
+-------+---+
|  Sunny| 29|
|   Paul| 24|
| Harsha| 21|
|Shubham| 23|
+-------+---+

In [123]:
data.filter("Salary<=20000").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [124]:
data.filter(data["Salary"]<=20000).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [125]:
data.filter((data["Salary"]<=20000) | (data['Salary']>=15000)).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [126]:
data.filter(~(data["Salary"]>=20000)).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [127]:
data.filter(~(data["Salary"]<=20000)).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
+---------+---+----------+------+

## Pyspark GroupBy And Aggregate Functions

In [128]:
spark=SparkSession.builder.appName('Agg').getOrCreate()

In [129]:
spark

In [130]:
data=spark.read.csv('test3.csv',header=True,inferSchema=True)

In [131]:
data.show()

+---------+------------+------+
|     Name| Departments|salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [132]:
data.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Departments: string (nullable = true)
 |-- salary: integer (nullable = true)

In [133]:
## Groupby

In [134]:
### Grouped to find the maximum salary
data.groupBy('Name').sum().show()

+---------+-----------+
|     Name|sum(salary)|
+---------+-----------+
|Sudhanshu|      35000|
|    Sunny|      12000|
|    Krish|      19000|
|   Mahesh|       7000|
+---------+-----------+

In [135]:
data.groupBy('Name').avg().show()

+---------+------------------+
|     Name|       avg(salary)|
+---------+------------------+
|Sudhanshu|11666.666666666666|
|    Sunny|            6000.0|
|    Krish| 6333.333333333333|
|   Mahesh|            3500.0|
+---------+------------------+

In [136]:
data.groupBy('Name').min().show()

+---------+-----------+
|     Name|min(salary)|
+---------+-----------+
|Sudhanshu|       5000|
|    Sunny|       2000|
|    Krish|       4000|
|   Mahesh|       3000|
+---------+-----------+

In [137]:
data.groupBy('Name').max().show()

+---------+-----------+
|     Name|max(salary)|
+---------+-----------+
|Sudhanshu|      20000|
|    Sunny|      10000|
|    Krish|      10000|
|   Mahesh|       4000|
+---------+-----------+

In [138]:
data.groupBy('Departments').sum().show()

+------------+-----------+
| Departments|sum(salary)|
+------------+-----------+
|         IOT|      15000|
|    Big Data|      15000|
|Data Science|      43000|
+------------+-----------+

In [139]:
data.groupBy('Departments').min().show()

+------------+-----------+
| Departments|min(salary)|
+------------+-----------+
|         IOT|       5000|
|    Big Data|       2000|
|Data Science|       3000|
+------------+-----------+

In [140]:
data.groupBy('Departments').mean().show()

+------------+-----------+
| Departments|avg(salary)|
+------------+-----------+
|         IOT|     7500.0|
|    Big Data|     3750.0|
|Data Science|    10750.0|
+------------+-----------+

In [141]:
data.groupBy('Departments').count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|         IOT|    2|
|    Big Data|    4|
|Data Science|    4|
+------------+-----+

In [142]:
data.agg({'Salary':'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|      73000|
+-----------+

In [143]:
data.agg({'Departments':'sum'}).show()

+----------------+
|sum(Departments)|
+----------------+
|            NULL|
+----------------+

## Examples Of Pyspark ML

In [144]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Missing').getOrCreate()

In [145]:
spark.sparkContext

In [150]:
SparkSession

pyspark.sql.session.SparkSession

In [151]:
training=spark.read.csv('test1.csv',header=True,inferSchema=True)

In [152]:
training

DataFrame[Name: string, age: int, Experience: int, Salary: int]

In [153]:
training.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [155]:
training.toPandas()

        Name  age  Experience  Salary
0      Krish   31          10   30000
1  Sudhanshu   30           8   25000
2      Sunny   29           4   20000
3       Paul   24           3   20000
4     Harsha   21           1   15000
5    Shubham   23           2   18000

In [156]:
training.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [157]:
training.columns

['Name', 'age', 'Experience', 'Salary']

In [158]:
training.toPandas().columns

Index(['Name', 'age', 'Experience', 'Salary'], dtype='object')

#### [Age,Experience]----> new feature--->independent feature

In [174]:
from pyspark.ml.feature import VectorAssembler

featureassembler=VectorAssembler(inputCols=["age","Experience"],outputCol="Independent Features")

output=featureassembler.transform(training)

output.show()

+---------+---+----------+------+--------------------+
|     Name|age|Experience|Salary|Independent Features|
+---------+---+----------+------+--------------------+
|    Krish| 31|        10| 30000|         [31.0,10.0]|
|Sudhanshu| 30|         8| 25000|          [30.0,8.0]|
|    Sunny| 29|         4| 20000|          [29.0,4.0]|
|     Paul| 24|         3| 20000|          [24.0,3.0]|
|   Harsha| 21|         1| 15000|          [21.0,1.0]|
|  Shubham| 23|         2| 18000|          [23.0,2.0]|
+---------+---+----------+------+--------------------+

### Explanation
- VectorAssembler: Combines "age" and "Experience" into a single vector column called "Independent Features".

- transform(training): Applies this transformation to the training DataFrame.

- output.show(): Displays the DataFrame with the new feature vector column.

In [163]:
output.select('Independent Features').show()

+--------------------+
|Independent Features|
+--------------------+
|         [31.0,10.0]|
|          [30.0,8.0]|
|          [29.0,4.0]|
|          [24.0,3.0]|
|          [21.0,1.0]|
|          [23.0,2.0]|
+--------------------+

In [164]:
output.columns

['Name', 'age', 'Experience', 'Salary', 'Independent Features']

In [169]:
finalized_data=output.select('Independent Features','Salary')

In [170]:
finalized_data.show()

+--------------------+------+
|Independent Features|Salary|
+--------------------+------+
|         [31.0,10.0]| 30000|
|          [30.0,8.0]| 25000|
|          [29.0,4.0]| 20000|
|          [24.0,3.0]| 20000|
|          [21.0,1.0]| 15000|
|          [23.0,2.0]| 18000|
+--------------------+------+

In [175]:
from pyspark.ml.regression import LinearRegression

train_data,test_data=finalized_data.randomSplit([0.75,0.25])

regressor=LinearRegression(featuresCol='Independent Features', labelCol='Salary')

regressor=regressor.fit(train_data)

#### Train-Test Split:

- train_data, test_data = finalized_data.randomSplit([0.75, 0.25]):
    - Splits the finalized_data DataFrame into 75% training data and 25% testing data.

- Linear Regression Model:

- regressor = LinearRegression(featuresCol='Independent Features', labelCol='Salary'):

        - Initializes a Linear Regression model where the feature column is "Independent Features" and the target label is     "Salary".

- Model Training:

- regressor = regressor.fit(train_data): Trains the Linear Regression model using the training data.

In [177]:
### Coefficients
regressor.coefficients

DenseVector([-90.5483, 1608.7819])

In [178]:
regressor.intercept

16079.136690647425

In [182]:
### Prediction
pred_results=regressor.evaluate(test_data)

In [183]:
pred_results.predictions.show()

+--------------------+------+-----------------+
|Independent Features|Salary|       prediction|
+--------------------+------+-----------------+
|          [23.0,2.0]| 18000|17214.09079632846|
+--------------------+------+-----------------+

In [184]:
pred_results.meanAbsoluteError,pred_results.meanSquaredError

(785.909203671541, 617653.2764156357)

### Overview
This notebook will show you how to create and query a table or DataFrame that you uploaded to DBFS. DBFS is a Databricks File System that allows you to store data for querying inside of Databricks. This notebook assumes that you have a file already inside of DBFS that you would like to read from.

This notebook is written in Python so the default cell type is Python. However, you can use different languages by using the %LANGUAGE syntax. Python, Scala, SQL, and R are all supported.

In [185]:
file_location = "tips.csv"
file_type = "csv"

# The applied options are for CSV files. For other file types, these will be ignored.
df =spark.read.csv(file_location,header=True,inferSchema=True)
df.show()

+----------+----+------+------+---+------+----+
|total_bill| tip|   sex|smoker|day|  time|size|
+----------+----+------+------+---+------+----+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|
|     25.29|4.71|  Male|    No|Sun|Dinner|   4|
|      8.77| 2.0|  Male|    No|Sun|Dinner|   2|
|     26.88|3.12|  Male|    No|Sun|Dinner|   4|
|     15.04|1.96|  Male|    No|Sun|Dinner|   2|
|     14.78|3.23|  Male|    No|Sun|Dinner|   2|
|     10.27|1.71|  Male|    No|Sun|Dinner|   2|
|     35.26| 5.0|Female|    No|Sun|Dinner|   4|
|     15.42|1.57|  Male|    No|Sun|Dinner|   2|
|     18.43| 3.0|  Male|    No|Sun|Dinner|   4|
|     14.83|3.02|Female|    No|Sun|Dinner|   2|
|     21.58|3.92|  Male|    No|Sun|Dinner|   2|
|     10.33|1.67|Female|    No|Sun|Dinner|   3|
|     16.29|3.71|  Male|    No|Sun|Dinner|   3|
|     16.97| 3.5|Female|    No|Sun|Dinner|   3|
|     20.65|3.35|  Male|    No|Sat|Dinner|   3|
+----------+----+------+------+---+------+----+
only showing top 20 rows

In [186]:
df.toPandas()

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [187]:
df.printSchema()

root
 |-- total_bill: double (nullable = true)
 |-- tip: double (nullable = true)
 |-- sex: string (nullable = true)
 |-- smoker: string (nullable = true)
 |-- day: string (nullable = true)
 |-- time: string (nullable = true)
 |-- size: integer (nullable = true)

In [188]:
df.columns

['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size']

In [189]:
### Handling Categorical Features
from pyspark.ml.feature import StringIndexer

In [190]:
df.show()

+----------+----+------+------+---+------+----+
|total_bill| tip|   sex|smoker|day|  time|size|
+----------+----+------+------+---+------+----+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|
|     25.29|4.71|  Male|    No|Sun|Dinner|   4|
|      8.77| 2.0|  Male|    No|Sun|Dinner|   2|
|     26.88|3.12|  Male|    No|Sun|Dinner|   4|
|     15.04|1.96|  Male|    No|Sun|Dinner|   2|
|     14.78|3.23|  Male|    No|Sun|Dinner|   2|
|     10.27|1.71|  Male|    No|Sun|Dinner|   2|
|     35.26| 5.0|Female|    No|Sun|Dinner|   4|
|     15.42|1.57|  Male|    No|Sun|Dinner|   2|
|     18.43| 3.0|  Male|    No|Sun|Dinner|   4|
|     14.83|3.02|Female|    No|Sun|Dinner|   2|
|     21.58|3.92|  Male|    No|Sun|Dinner|   2|
|     10.33|1.67|Female|    No|Sun|Dinner|   3|
|     16.29|3.71|  Male|    No|Sun|Dinner|   3|
|     16.97| 3.5|Female|    No|Sun|Dinner|   3|
|     20.65|3.35|  Male|    No|Sat|Dinner|   3|
+----------+----+------+------+---+------+----+
only showing top 20 rows

In [191]:
indexer=StringIndexer(inputCol="sex",outputCol="sex_indexed")
df_r=indexer.fit(df).transform(df)
df_r.show()

+----------+----+------+------+---+------+----+-----------+
|total_bill| tip|   sex|smoker|day|  time|size|sex_indexed|
+----------+----+------+------+---+------+----+-----------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|        1.0|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|        0.0|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|        0.0|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|        0.0|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|        1.0|
|     25.29|4.71|  Male|    No|Sun|Dinner|   4|        0.0|
|      8.77| 2.0|  Male|    No|Sun|Dinner|   2|        0.0|
|     26.88|3.12|  Male|    No|Sun|Dinner|   4|        0.0|
|     15.04|1.96|  Male|    No|Sun|Dinner|   2|        0.0|
|     14.78|3.23|  Male|    No|Sun|Dinner|   2|        0.0|
|     10.27|1.71|  Male|    No|Sun|Dinner|   2|        0.0|
|     35.26| 5.0|Female|    No|Sun|Dinner|   4|        1.0|
|     15.42|1.57|  Male|    No|Sun|Dinner|   2|        0.0|
|     18.43| 3.0|  Male|    No|Sun|Dinner|   4|        0.0|
|     14.83|3.02|Female|    No|Sun|Dinner|   2|        1.0|
|     21.58|3.92|  Male|    No|Sun|Dinner|   2|        0.0|
|     10.33|1.67|Female|    No|Sun|Dinner|   3|        1.0|
|     16.29|3.71|  Male|    No|Sun|Dinner|   3|        0.0|
|     16.97| 3.5|Female|    No|Sun|Dinner|   3|        1.0|
|     20.65|3.35|  Male|    No|Sat|Dinner|   3|        0.0|
+----------+----+------+------+---+------+----+-----------+
only showing top 20 rows

In [192]:
indexer=StringIndexer(inputCols=["smoker","day","time"],outputCols=["smoker_indexed","day_indexed",
                                                                  "time_index"])
df_r=indexer.fit(df_r).transform(df_r)
df_r.show()

+----------+----+------+------+---+------+----+-----------+--------------+-----------+----------+
|total_bill| tip|   sex|smoker|day|  time|size|sex_indexed|smoker_indexed|day_indexed|time_index|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+----------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|        1.0|           0.0|        1.0|       0.0|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|       0.0|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|       0.0|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|        1.0|           0.0|        1.0|       0.0|
|     25.29|4.71|  Male|    No|Sun|Dinner|   4|        0.0|           0.0|        1.0|       0.0|
|      8.77| 2.0|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     26.88|3.12|  Male|    No|Sun|Dinner|   4|        0.0|           0.0|        1.0|       0.0|
|     15.04|1.96|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     14.78|3.23|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     10.27|1.71|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     35.26| 5.0|Female|    No|Sun|Dinner|   4|        1.0|           0.0|        1.0|       0.0|
|     15.42|1.57|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     18.43| 3.0|  Male|    No|Sun|Dinner|   4|        0.0|           0.0|        1.0|       0.0|
|     14.83|3.02|Female|    No|Sun|Dinner|   2|        1.0|           0.0|        1.0|       0.0|
|     21.58|3.92|  Male|    No|Sun|Dinner|   2|        0.0|           0.0|        1.0|       0.0|
|     10.33|1.67|Female|    No|Sun|Dinner|   3|        1.0|           0.0|        1.0|       0.0|
|     16.29|3.71|  Male|    No|Sun|Dinner|   3|        0.0|           0.0|        1.0|       0.0|
|     16.97| 3.5|Female|    No|Sun|Dinner|   3|        1.0|           0.0|        1.0|       0.0|
|     20.65|3.35|  Male|    No|Sat|Dinner|   3|        0.0|           0.0|        0.0|       0.0|
+----------+----+------+------+---+------+----+-----------+--------------+-----------+----------+
only showing top 20 rows

In [195]:
indexer=StringIndexer(inputCols=["smoker","day","time","sex"],outputCols=["smoker_indexed","day_indexed",
                                                                  "time_index","sex_indexed"])
df_r=indexer.fit(df).transform(df)

df_r.show()

+----------+----+------+------+---+------+----+--------------+-----------+----------+-----------+
|total_bill| tip|   sex|smoker|day|  time|size|smoker_indexed|day_indexed|time_index|sex_indexed|
+----------+----+------+------+---+------+----+--------------+-----------+----------+-----------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        1.0|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        0.0|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        0.0|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        1.0|
|     25.29|4.71|  Male|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        0.0|
|      8.77| 2.0|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     26.88|3.12|  Male|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        0.0|
|     15.04|1.96|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     14.78|3.23|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     10.27|1.71|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     35.26| 5.0|Female|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        1.0|
|     15.42|1.57|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     18.43| 3.0|  Male|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        0.0|
|     14.83|3.02|Female|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        1.0|
|     21.58|3.92|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|
|     10.33|1.67|Female|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        1.0|
|     16.29|3.71|  Male|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        0.0|
|     16.97| 3.5|Female|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        1.0|
|     20.65|3.35|  Male|    No|Sat|Dinner|   3|           0.0|        0.0|       0.0|        0.0|
+----------+----+------+------+---+------+----+--------------+-----------+----------+-----------+
only showing top 20 rows

In [196]:
df_r.columns

['total_bill',
 'tip',
 'sex',
 'smoker',
 'day',
 'time',
 'size',
 'smoker_indexed',
 'day_indexed',
 'time_index',
 'sex_indexed']

In [197]:
from pyspark.ml.feature import VectorAssembler

featureassembler=VectorAssembler(inputCols=['tip','size','sex_indexed','smoker_indexed','day_indexed',
                          'time_index'],outputCol="Independent Features")

output=featureassembler.transform(df_r)

In [198]:
output.select('Independent Features').show()

+--------------------+
|Independent Features|
+--------------------+
|[1.01,2.0,1.0,0.0...|
|[1.66,3.0,0.0,0.0...|
|[3.5,3.0,0.0,0.0,...|
|[3.31,2.0,0.0,0.0...|
|[3.61,4.0,1.0,0.0...|
|[4.71,4.0,0.0,0.0...|
|[2.0,2.0,0.0,0.0,...|
|[3.12,4.0,0.0,0.0...|
|[1.96,2.0,0.0,0.0...|
|[3.23,2.0,0.0,0.0...|
|[1.71,2.0,0.0,0.0...|
|[5.0,4.0,1.0,0.0,...|
|[1.57,2.0,0.0,0.0...|
|[3.0,4.0,0.0,0.0,...|
|[3.02,2.0,1.0,0.0...|
|[3.92,2.0,0.0,0.0...|
|[1.67,3.0,1.0,0.0...|
|[3.71,3.0,0.0,0.0...|
|[3.5,3.0,1.0,0.0,...|
|(6,[0,1],[3.35,3.0])|
+--------------------+
only showing top 20 rows

In [199]:
output.show()

+----------+----+------+------+---+------+----+--------------+-----------+----------+-----------+--------------------+
|total_bill| tip|   sex|smoker|day|  time|size|smoker_indexed|day_indexed|time_index|sex_indexed|Independent Features|
+----------+----+------+------+---+------+----+--------------+-----------+----------+-----------+--------------------+
|     16.99|1.01|Female|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        1.0|[1.01,2.0,1.0,0.0...|
|     10.34|1.66|  Male|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        0.0|[1.66,3.0,0.0,0.0...|
|     21.01| 3.5|  Male|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        0.0|[3.5,3.0,0.0,0.0,...|
|     23.68|3.31|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[3.31,2.0,0.0,0.0...|
|     24.59|3.61|Female|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        1.0|[3.61,4.0,1.0,0.0...|
|     25.29|4.71|  Male|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        0.0|[4.71,4.0,0.0,0.0...|
|      8.77| 2.0|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[2.0,2.0,0.0,0.0,...|
|     26.88|3.12|  Male|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        0.0|[3.12,4.0,0.0,0.0...|
|     15.04|1.96|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[1.96,2.0,0.0,0.0...|
|     14.78|3.23|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[3.23,2.0,0.0,0.0...|
|     10.27|1.71|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[1.71,2.0,0.0,0.0...|
|     35.26| 5.0|Female|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        1.0|[5.0,4.0,1.0,0.0,...|
|     15.42|1.57|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[1.57,2.0,0.0,0.0...|
|     18.43| 3.0|  Male|    No|Sun|Dinner|   4|           0.0|        1.0|       0.0|        0.0|[3.0,4.0,0.0,0.0,...|
|     14.83|3.02|Female|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        1.0|[3.02,2.0,1.0,0.0...|
|     21.58|3.92|  Male|    No|Sun|Dinner|   2|           0.0|        1.0|       0.0|        0.0|[3.92,2.0,0.0,0.0...|
|     10.33|1.67|Female|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        1.0|[1.67,3.0,1.0,0.0...|
|     16.29|3.71|  Male|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        0.0|[3.71,3.0,0.0,0.0...|
|     16.97| 3.5|Female|    No|Sun|Dinner|   3|           0.0|        1.0|       0.0|        1.0|[3.5,3.0,1.0,0.0,...|
|     20.65|3.35|  Male|    No|Sat|Dinner|   3|           0.0|        0.0|       0.0|        0.0|(6,[0,1],[3.35,3.0])|
+----------+----+------+------+---+------+----+--------------+-----------+----------+-----------+--------------------+
only showing top 20 rows

In [200]:
finalized_data=output.select("Independent Features","total_bill")

In [201]:
finalized_data.show()

+--------------------+----------+
|Independent Features|total_bill|
+--------------------+----------+
|[1.01,2.0,1.0,0.0...|     16.99|
|[1.66,3.0,0.0,0.0...|     10.34|
|[3.5,3.0,0.0,0.0,...|     21.01|
|[3.31,2.0,0.0,0.0...|     23.68|
|[3.61,4.0,1.0,0.0...|     24.59|
|[4.71,4.0,0.0,0.0...|     25.29|
|[2.0,2.0,0.0,0.0,...|      8.77|
|[3.12,4.0,0.0,0.0...|     26.88|
|[1.96,2.0,0.0,0.0...|     15.04|
|[3.23,2.0,0.0,0.0...|     14.78|
|[1.71,2.0,0.0,0.0...|     10.27|
|[5.0,4.0,1.0,0.0,...|     35.26|
|[1.57,2.0,0.0,0.0...|     15.42|
|[3.0,4.0,0.0,0.0,...|     18.43|
|[3.02,2.0,1.0,0.0...|     14.83|
|[3.92,2.0,0.0,0.0...|     21.58|
|[1.67,3.0,1.0,0.0...|     10.33|
|[3.71,3.0,0.0,0.0...|     16.29|
|[3.5,3.0,1.0,0.0,...|     16.97|
|(6,[0,1],[3.35,3.0])|     20.65|
+--------------------+----------+
only showing top 20 rows

In [202]:
from pyspark.ml.regression import LinearRegression
train_data,test_data=finalized_data.randomSplit([0.75,0.25])
regressor=LinearRegression(featuresCol='Independent Features', labelCol='total_bill')
regressor=regressor.fit(train_data)

In [203]:
regressor.coefficients

DenseVector([3.2622, 3.064, -1.0833, 1.9405, -0.5259, -0.6619])

In [204]:
regressor.intercept

2.4660745408923277

In [205]:

### Predictions
pred_results=regressor.evaluate(test_data)

In [207]:
pred_results.predictions.show()

+--------------------+----------+------------------+
|Independent Features|total_bill|        prediction|
+--------------------+----------+------------------+
|(6,[0,1],[1.45,2.0])|      9.55|13.324271388982917|
|(6,[0,1],[1.97,2.0])|     12.02|15.020624264243443|
| (6,[0,1],[2.0,2.0])|     12.69|15.118490776277703|
|(6,[0,1],[2.01,2.0])|     20.23| 15.15111294695579|
|(6,[0,1],[2.24,3.0])|     16.04| 18.96541392243578|
| (6,[0,1],[3.0,2.0])|      14.0| 18.38070784408641|
| (6,[0,1],[3.6,3.0])|     24.06|23.402029134655614|
|(6,[0,1],[4.08,2.0])|     17.92| 21.90390227731981|
| (6,[0,1],[4.3,2.0])|      21.7|22.621590032237723|
|(6,[0,1],[5.92,3.0])|     29.03|30.970372731971807|
| (6,[0,1],[9.0,4.0])|     48.33|  44.0819923507066|
|[1.0,1.0,1.0,1.0,...|      3.07| 9.649512880249205|
|[1.01,2.0,1.0,0.0...|     16.99|10.279775940869396|
|[1.17,2.0,0.0,1.0...|     32.83|  14.3513498552698|
|[1.25,2.0,1.0,0.0...|      8.51|  9.87499077042205|
|[1.44,2.0,0.0,0.0...|      7.56|11.578081036914837|
|[1.44,2.0,0.0,1.0...|      7.74| 15.23214846357815|
|[1.48,2.0,0.0,0.0...|      8.52|11.708569719627185|
|[1.5,2.0,1.0,0.0,...|     11.17|10.690545037374227|
|[1.61,2.0,1.0,1.0...|     10.59|14.703456341496498|
+--------------------+----------+------------------+
only showing top 20 rows

In [208]:
### PErformance Metrics
pred_results.r2,pred_results.meanAbsoluteError,pred_results.meanSquaredError

(0.5873207282167145, 4.21198106123386, 35.01938804673168)